import pandas as pd # Библиотека для работы с базами

df = pd.read_csv('./moscow.csv', sep=";") #Загружаем данные в data frame

#Метро внутри кольца
metroNamesInsideCircle = ["Китай-Город","Библиотека им.Ленина", "Площадь Революции", "Арбатская", "Смоленская", "Красные Ворота", "Красные ворота", "Чистые пруды", "Лубянка", "Охотный Ряд", "Охотный ряд", "Библиотека имени Ленина", "Кропоткинская", "Сухаревская", "Тургеневская", "Китай-город", "Китай-Город" "Третьяковская", "Трубная", "Сретенский бульвар", "Цветной бульвар", "Чеховская", "Боровицкая", "Полянка", "Маяковская", "Тверская", "Театральная", "Новокузнецкая", "Пушкинская", "Кузнецкий Мост", "Кузнецкий мост", "Китай-город", "Александровский сад", "Александровский Сад"]
#Метро на кольце
metroNamesCircle = ["Баррикадная", "Марксистская", "Чкаловская", "Менделеевская", "Киевская", "Парк Культуры", "Парк культуры", "Октябрьская", "Добрынинская", "Павелецкая", "Таганская", "Курская", "Комсомольская", "Проспект Мира", "Новослободская", "Белорусская", "Краснопресненская", "Серпуховская"]
#Метро 1-3 станции от кольца
metroNames13FromCircle = ["Улица 1905 года", "Лужники", "Москва-Товарная", "Бауманская", "Электрозаводская", "Семеновская", "Площадь Ильича", "Авиамоторная", "Шоссе Энтузиастов", "Римская", "Крестьянская Застава", "Дубровка", "Пролетарская", "Волгоградский проспект", "Текстильщики", "Автозаводская", "Технопарк", "Коломенская", "Тульская", "Нагатинская", "Нагорная", "Шаболовская", "Ленинский проспект", "Академическая", "Фрунзенская", "Спортивная", "Воробьевы горы", "Воробьевы Горы", "Студенческая", "Кутузовская", "Фили", "Парк Победы", "Выставочная", "Международная", "Улица 1905", "улица 1905", "Беговая", "Полежаевская", "Динамо", "Петровский Парк", "Аэропорт (старая)", "Аэропорт", "Сокол", "Деловой центр", "Шелепиха", "Хорошевская", "ЦСКА", "Петровский парк", "Савеловская", "Дмитровская", "Тимирязевская", "Достоевская", "Марьина Роща", "Марьина роща", "Бутырская", "Фонвизинская", "Рижская", "Алексеевская", "ВДНХ", "Красносельская", "Сокольники", "Преображенская площадь", "Калитники", "Новохохловская", "Минская", "Славянский бульвар"]
#Метро 4-8 станций от кольа
metroNames48FromCircle = ["Каховская", "Перерва", "Новаторская", "Депо", "Румянцево", "Юго-Западная", "Народное ополчение", "Проспект Вернадского", "Говорово", "Лефортово", "Мневники", "Строгино", "Лианозово", "Нахимовский проспект", "Красный Балтиец", "Бескудниково", "Москворечье", "Домодедовская", "Озерная", "Раменки", "Крылатское", "Аминьевская", "Мякинино", "Стахановская", "Тестовская", "Зорге", "Ростокино", "ЗИЛ", "Партизанская", "Измайловская", "Первомайская", "Щелковская", "Новокосино", "Новогиреево", "Перово", "Кузьминки", "Рязанский проспект", "Выхино", "Лермонтовский проспект", "Жулебино", "Партизанская", "Измайловская", "Первомайская", "Щелковская", "Новокосино", "Новогиреево", "Перово", "Кузьминки", "Рязанский проспект", "Выхино", "Лермонтовский проспект", "Жулебино", "Улица Дмитриевского", "улица Дмитриевского", "Кожуховская", "Печатники", "Волжская", "Люблино", "Братиславская", "Коломенская", "Каширская", "Кантемировская", "Царицыно", "Орехово", "Севастопольская", "Чертановская", "Южная", "Пражская", "Варшавская", "Профсоюзная", "Новые Черемушки", "Калужская", "Беляево", "Коньково", "Университет", "Багратионовская", "Филевский парк", "Пионерская", "Кунцевская", "Молодежная", "Октябрьское Поле", "Октябрьское поле", "Щукинская", "Спартак", "Тушинская", "Сходненская", "Войковская", "Стрешнево", "Панфиловская", "Балтийская", "Водный стадион", "Речной вокзал", "Беломорская", "Ховрино", "Петровско-Разумовская", "Владыкино", "Отрадное", "Бибирево", "Алтуфьево", "Фонвизинская", "Окружная", "Верхние Лихоборы", "Селигерская", "ВДНХ", "Ботанический сад", "Свиблово", "Бабушкинская", "Медведково", "Преображенская площадь", "Черкизовская", "Бульвар Рокоссовского", "Воронцовская", "Терехово", "Угрешская", "Мичуринский проспект", "Давыдково", "Ломоносовский проспект"]
#Метро 9+ станций от кольа
metroNames9AndMoreFromCircle = ["Алма-Атинская", "Бульвар Адмирала Ушакова", "Силикатная", "Новоясеневская", "Новопеределкино", "Улица Скобелевская", "Улица Старокачаловская", "Красный Строитель", "Нахабино","Щербинка", "Филатов Луг", "Сколково", "Окская", "Пятницкое шоссе", "Юго-Восточная", "Курьяново", "Марьино", "Некрасовка", "Саларьево", "Рассказовка", "Боровское шоссе", "Сетунь", "Митино", "Теплый Стан","Бутово", "Улица Горчакова", "Лесопарковая", "Шипиловская", "Зябликово", "Бульвар Дмитрия","Марк", "Трикотажная", "Аннино","Бунинская Аллея", "Бунинская аллея", "Коммунарка", "Ольховая", "Долгопрудная", "Улица Академика", "улица Академика", "Бульвар Адмирала", "Прокшино"]
MCCNames = ["Окружная", "Владыкино", "Ботанический сад", "Ростокино", "Белокаменная", "Бульвар Рокоссовского", "Локомотив", "Измайлово", "Соколиная Гора", "Шоссе Энтузиастов", "Андроновка", "Нижегородская", "Новохохловская", "Угрешская", "Дубровка", "Автозаводская", "ЗИЛ", "Верхние Котлы", "Верхние котлы", "Крымская", "Площадь Гагарина", "Лужники", "Кутузовская", "Деловой центр", "Шелепиха", "Хорошево", "Зорге", "Панфиловская", "Стрешнево", "Балтийская", "Коптево", "Лихоборы"]
allMertroNames = list(df['Метро / ЖД станции'].unique())
print(len(allMertroNames))
a = 0
for i in allMertroNames:
    try:
        i = i.split()
        if i[-1] == '(МЦК)': 
            i = " ".join(i[:-2])
        else: i = " ".join(i[:-1])
    except: 
        print(i)
        continue
    # try:
    #     if i[1] == '⋅' or i[1] == "откроется":
    #         i = i[0]
    #     else: i = " ".join(i)
    # except:
    #     i = " ".join(i)
    if i not in metroNamesInsideCircle:
        if i not in metroNamesCircle:
            if i not in metroNames13FromCircle:
                if i not in metroNames48FromCircle:
                    if i not in metroNames9AndMoreFromCircle:
                        if i not in MCCNames:
                            print(i)
                            a += 1
print(a)