# -*- coding: utf-8 -*-
import pandas as pd
import requests
import math
from tokens import yandexToken as token
from estimate import estimation

# fileWay = 'Шаблон.xlsx'
def readExcel(fileWay):
    excel_data = pd.read_excel(fileWay)
    data = pd.DataFrame(excel_data,columns=['Местоположение', 'Количество комнат', 'Сегмент (Новостройка, современное жилье, старый жилой фонд)', 'Этажность дома', 'Материал стен (Кипич, панель, монолит)', 'Этаж расположения',	'Площадь квартиры, кв.м',	'Площадь кухни, кв.м',	'Наличие балкона/лоджии',	'Удаленность от станции метро, мин. пешком',	'Состояние (без отделки, муниципальный ремонт, с современная отделка)'])
    prices = []
    for index, row in data.iterrows():
        prices.append(getEstimationDict(row))
    data['Цена'] = prices
    writer = pd.ExcelWriter('./Результат оценки.xlsx') 
    data.to_excel(writer, 'Prices') 
    writer.save()


def getEstimationDict(data):
    location = data['Местоположение'].rstrip(',').split()
    location='+'.join(location)
    metroList = {'китай-город': '37.631299 55.757009', 'библиотека им.ленина': '37.610116 55.75132', 'площадь революции': '37.622729 55.756807', 'арбатская': '37.601367 55.75207', 'смоленская': '37.58217 55.748762', 'красные ворота': '37.649229 55.768664', 'чистые пруды': '37.638692 55.764794', 'лубянка': '37.626762 55.759618', 'охотный ряд': '37.615524 55.756969', 'библиотека имени ленина': '37.610116 55.75132', 'кропоткинская': '37.603487 55.745073', 'сухаревская': '37.632305 55.772497', 'тургеневская': '37.636751 55.765235', 'китай-городтретьяковская': '37.62563 55.741267', 'трубная': '37.621884 55.767939', 'сретенский бульвар': '37.638404 55.765564', 'цветной бульвар': '37.620734 55.771758', 'чеховская': '37.608167 55.765843', 'боровицкая': '37.608652 55.750575', 'полянка': '37.618695 55.736904', 'маяковская': '37.595914 55.76996', 'тверская': '37.605948 55.76446', 'театральная': '37.619001 55.757967', 'новокузнецкая': '37.629241 55.742372', 'пушкинская': '37.6039 55.765752', 'кузнецкий мост': '37.624516 55.761512', 'александровский сад': '37.60947 55.752354', 'баррикадная': '37.58128 55.760818', 'марксистская': '37.655957 55.741303', 'чкаловская': '37.658006 55.755809', 'менделеевская': '37.598699 55.781823', 'киевская': '37.565587 55.743588', 'парк культуры': '37.592869 55.735307', 'октябрьская': '37.611185 55.729219', 'добрынинская': '37.622747 55.728996', 'павелецкая': '37.637003 55.73182', 'таганская': '37.652957 55.739549', 'курская': '37.65876 55.758468', 'комсомольская': '37.6547 55.775707', 'проспект мира': '37.633032 55.781747', 'новослободская': '37.601421 55.779565', 'белорусская': '37.582215 55.777393', 'краснопресненская': '37.57722 55.760216', 'серпуховская': '37.6251 55.727293', 'улица 1905 года': '37.561401 55.764759', 'лужники': '37.560323 55.720834', 'москва-товарная': '37.688315 55.745656', 'бауманская': '37.679044 55.772411', 'электрозаводская': '37.70302 55.780284', 'семеновская': '37.719423 55.7832', 'площадь ильича': '37.680949 55.747069', 'авиамоторная': '37.716621 55.751437', 'шоссе энтузиастов': '37.751547 55.758412', 'римская': '37.681245 55.746233', 'крестьянская застава': '37.66503 55.732651', 'дубровка': '37.67625 55.71807', 'пролетарская': '37.666162 55.731673', 'волгоградский проспект': '37.687084 55.724981', 'текстильщики': '37.732593 55.708831', 'автозаводская': '37.6577 55.707299', 'технопарк': '37.664428 55.693931', 'коломенская': '37.663836 55.678412', 'тульская': '37.622621 55.708841', 'нагатинская': '37.622872 55.683392', 'нагорная': '37.610592 55.672691', 'шаболовская': '37.607933 55.718821', 'ленинский проспект': '37.585592 55.707202', 'академическая': '37.573447 55.687766', 'фрунзенская': '37.580463 55.727313', 'спортивная': '37.564123 55.723328', 'воробьевы горы': '37.559335 55.710433', 'студенческая': '37.548402 55.738809', 'кутузовская': '37.5342 55.74033', 'фили': '37.514958 55.74597', 'парк победы': '37.516009 55.736934', 'выставочная': '37.541431 55.750175', 'международная': '37.534263 55.748311', 'улица 1905': '27.428539 38.609534', 'беговая': '37.546004 55.773707', 'полежаевская': '37.519315 55.777449', 'динамо': '37.558212 55.789704', 'петровский парк': '37.557197 55.79185', 'аэропорт (старая)': '37.531774 55.800979', 'аэропорт': '37.531774 55.800979', 'сокол': '37.514796 55.805047', 'деловой центр': '37.538062 55.748762', 'хорошевская': '37.520797 55.776867', 'цска': '37.53331 55.786607', 'савеловская': '37.586122 55.792807', 'дмитровская': '37.581262 55.807602', 'тимирязевская': '37.57528 55.8187', 'достоевская': '37.614707 55.781499', 'марьина роща': '37.616485 55.795069', 'бутырская': '37.602481 55.8134', 'фонвизинская': '37.587353 55.822893', 'рижская': '37.636123 55.792488', 'алексеевская': '37.638737 55.807805', 'вднх': '37.641045 55.821097', 'красносельская': '37.666225 55.779818', 'сокольники': '37.67988 55.788996', 'преображенская площадь': '37.715022 55.796172', 'калитники': '37.701978 55.734151', 'новохохловская': '37.716746 55.724084', 'минская': '37.497414 55.724074', 'славянский бульвар': '37.470581 55.729579', 'каховская': '37.597612 55.652822', 'перерва': '37.716998 55.661415', 'новаторская': '37.52218 55.669823', 'депо': '37.617644 55.755819', 'румянцево': '37.441404 55.633028', 'юго-западная': '37.483095 55.663634', 'народное ополчение': '37.48508 55.775702', 'проспект вернадского': '37.503747 55.678519', 'говорово': '37.417266 55.659551', 'лефортово': '37.706757 55.764698', 'мневники': '37.47139 55.761153', 'строгино': '37.403118 55.803697', 'лианозово': '37.553585 55.897195', 'нахимовский проспект': '37.605373 55.662501', 'красный балтиец': '37.526627 55.815483', 'бескудниково': '37.567698 55.882187', 'москворечье': '37.689087 55.640396', 'домодедовская': '37.718669 55.610845', 'озерная': '37.449012 55.67058', 'раменки': '37.498734 55.697691', 'крылатское': '37.408139 55.756842', 'аминьевская': '37.464931 55.697189', 'мякинино': '37.38534 55.824895', 'стахановская': '37.752257 55.727207', 'тестовская': '37.531693 55.754152', 'зорге': '37.504223 55.789158', 'ростокино': '37.668408 55.839224', 'зил': '37.649049 55.698624', 'партизанская': '37.749984 55.788464', 'измайловская': '37.781506 55.787761', 'первомайская': '37.799427 55.794614', 'щелковская': '37.798592 55.809717', 'новокосино': '37.864061 55.745113', 'новогиреево': '37.817169 55.751665', 'перово': '37.786887 55.75132', 'кузьминки': '37.766154 55.705463', 'рязанский проспект': '37.793364 55.717097', 'выхино': '37.81804 55.715606', 'лермонтовский проспект': '37.852383 55.701704', 'жулебино': '37.855797 55.685137', 'улица дмитриевского': '37.879054 55.710311', 'кожуховская': '37.685341 55.706371', 'печатники': '37.727921 55.693155', 'волжская': '37.753164 55.690902', 'люблино': '37.761869 55.675682', 'братиславская': '37.750451 55.659409', 'каширская': '37.64834 55.654782', 'кантемировская': '37.656218 55.636107', 'царицыно': '37.669154 55.621607', 'орехово': '37.695268 55.612934', 'севастопольская': '37.59833 55.652085', 'чертановская': '37.606325 55.640609', 'южная': '37.608984 55.622278', 'пражская': '37.604565 55.612599', 'варшавская': '37.619522 55.653294', 'профсоюзная': '37.562874 55.67793', 'новые черемушки': '37.554493 55.670077', 'калужская': '37.540075 55.656682', 'беляево': '37.525827 55.642753', 'коньково': '37.519018 55.633155', 'университет': '37.533526 55.692612', 'багратионовская': '37.497863 55.743801', 'филевский парк': '37.483328 55.739524', 'пионерская': '37.467087 55.735991', 'кунцевская': '37.44559 55.730629', 'молодежная': '37.416619 55.740872', 'октябрьское поле': '37.493326 55.793586', 'щукинская': '37.463772 55.808832', 'спартак': '37.43525 55.818103', 'тушинская': '37.437316 55.826417', 'сходненская': '37.439535 55.85052', 'войковская': '37.498016 55.819064', 'стрешнево': '37.486975 55.813703', 'панфиловская': '37.49983 55.798019', 'балтийская': '37.494728 55.825153', 'водный стадион': '37.486796 55.839891', 'речной вокзал': '37.476231 55.854891', 'беломорская': '37.475692 55.865374', 'ховрино': '37.480777 55.878273', 'петровско-разумовская': '37.57422 55.834451', 'владыкино': '37.59038 55.847983', 'отрадное': '37.604771 55.863212', 'бибирево': '37.60302 55.883873', 'алтуфьево': '37.587362 55.898205', 'окружная': '37.574229 55.845542', 'верхние лихоборы': '37.561041 55.856235', 'селигерская': '37.547126 55.866561', 'ботанический сад': '37.637946 55.844895', 'свиблово': '37.652625 55.855179', 'бабушкинская': '37.664204 55.86947', 'медведково': '37.661536 55.887473', 'черкизовская': '37.744927 55.803676', 'бульвар рокоссовского': '37.734165 55.814588', 'воронцовская': '37.539446 55.658845', 'терехово': '37.459738 55.748108', 'угрешская': '37.695555 55.717944', 'мичуринский проспект': '37.48278 55.689355', 'давыдково': '37.45177 55.71517', 'ломоносовский проспект': '37.516063 55.70706', 'алма-атинская': '37.765911 55.632825', 'бульвар адмирала ушакова': '37.542833 55.545319', 'силикатная': '37.555454 55.470459', 'новоясеневская': '37.553837 55.601717', 'новопеределкино': '37.355228 55.639613', 'улица скобелевская': '37.554645 55.548049', 'улица старокачаловская': '37.576412 55.568431', 'красный строитель': '37.615075 55.589753', 'нахабино': '37.184854 55.84166', 'щербинка': '37.5622 55.51016', 'филатов луг': '37.407995 55.601182', 'сколково': '37.342535 55.700096', 'окская': '37.781281 55.718623', 'пятницкое шоссе': '37.354141 55.855967', 'юго-восточная': '37.817995 55.705351', 'курьяново': '37.701439 55.649855', 'марьино': '37.743471 55.650028', 'некрасовка': '37.928039 55.702967', 'саларьево': '37.424057 55.621816', 'рассказовка': '37.334756 55.633968', 'боровское шоссе': '37.370131 55.647671', 'сетунь': '37.396722 55.723587', 'митино': '37.362163 55.845734', 'теплый стан': '37.506541 55.618649', 'бутово': '37.57068 55.541698', 'улица горчакова': '37.531514 55.541937', 'лесопарковая': '37.57731 55.581968', 'шипиловская': '37.743696 55.621165', 'зябликово': '37.745187 55.612334', 'бульвар дмитрия': '37.577355 55.569673', 'марк': '37.538269 55.904443', 'трикотажная': '37.398976 55.833137', 'аннино': '37.59674 55.583205', 'бунинская аллея': '37.515928 55.537969', 'коммунарка': '37.46865 55.560071', 'ольховая': '37.459056 55.56898', 'долгопрудная': '37.520033 55.940034', 'улица академика': '37.600873 55.595293', 'бульвар адмирала': '37.542833 55.545319', 'прокшино': '37.43322 55.586456', 'белокаменная': '37.702319 55.82938', 'локомотив': '37.745969 55.804056', 'измайлово': '37.743058 55.788722', 'соколиная гора': '37.745385 55.769919', 'андроновка': '37.73703 55.746507', 'нижегородская': '37.730482 55.731632', 'верхние котлы': '37.618767 55.69008', 'крымская': '37.605122 55.690004', 'площадь гагарина': '37.58658 55.706776', 'шелепиха': '37.524076 55.757121', 'хорошево': '37.507502 55.776922', 'коптево': '37.521417 55.840452', 'лихоборы': '37.553046 55.847674'}
    response = requests.get(f'https://geocode-maps.yandex.ru/1.x/?format=json&apikey={token}&geocode={location}')                                                   
    jsn = response.json()
    lanLat = jsn['response']['GeoObjectCollection']['featureMember'][0]['GeoObject']['Point']['pos']
    metro = ''
    metroDist = 10000000000
    for i in metroList.values():
        distance = getDistance(lanLat, i)
        if metroDist > distance:
            metroDist = distance
            metro = list(metroList.keys())[list(metroList.values()).index(i)]
    metroDistance = f'{data["Удаленность от станции метро, мин. пешком"]}п'
    floor = data["Этаж расположения"]
    floors = data["Этажность дома"]
    area = data["Площадь квартиры, кв.м"]
    isLastFloor = 0
    if (floor == floors):
        isLastFloor = 1
    balcon = '-'
    if (data["Наличие балкона/лоджии"].lower() == "да"):
        balcon = 'Б'
    wc = 'Р'
    houseType = '-'
    if (data["Наличие балкона/лоджии"].lower() == "панель"):
        houseType = 'П'
    if (data["Наличие балкона/лоджии"].lower() == "монолит"):
        houseType = 'М'
    if (data["Наличие балкона/лоджии"].lower() == "кирпич"):
        houseType = 'К'
    predUnscaled = estimation(1, metro,metroDistance,floor,floors,area,isLastFloor,wc,balcon, houseType)
    return predUnscaled
    # return {'rooms':1, 'metro': metro, 'metroDistance': metroDistance,'floor': floor,'floors':floors, 'area':area, 'isLastFloor': isLastFloor,'wc':wc,'balcon': balcon, 'houseType':houseType}

def getDistance(cd1, cd2):
    lon1 = float(cd1.split()[0])
    lat1 = float(cd1.split()[1])
    lon2 = float(cd2.split()[0])
    lat2 = float(cd2.split()[1])
    d = math.sqrt(((lat1+lon1)-(lat2+lon2))**2)
    return d


# print(readExcel(fileWay))